IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
/**-------------------------------------------------------------------------
@file	bt_app_bm.cpp

@brief	Bluetooth application creation helper using baremetal SDK (S145)

This implementation targets the nRF54L15 with SoftDevice S145 via the
sdk-nrf-bm bare-metal framework.  It replaces both the legacy nRF5_SDK
(bt_app_nrf52) and the SDC/MPSL (bt_app_sdc) paths with a thin layer
over the S145 sd_ble_* SVC API, wired through the sdk-nrf-bm observer
infrastructure (nrf_sdh / nrf_sdh_ble).

@author	Hoang Nguyen Hoan
@date	Feb. 13, 2026

@license

MIT License

Copyright (c) 2026 I-SYST INC, all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <stdio.h>
#include <inttypes.h>
#include <atomic>
#include <stdlib.h>
#include <string.h>

#include "nrf_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"

#include "nrf_sdm.h"
#include "bm/softdevice_handler/nrf_sdh_ble.h"
#include "bm/softdevice_handler/nrf_sdh_soc.h"
#include "bm/bluetooth/ble_conn_state.h"
#include "bm/bluetooth/ble_conn_params.h"
#include "bm/bluetooth/services/ble_dis.h"
#include "nrfx_cracen.h"

#include "nrf_soc.h"
#include "mpsl.h"

#include "istddef.h"
#include "idelay.h"
#include "coredev/system_core_clock.h"
#include "coredev/iopincfg.h"
#include "iopinctrl.h"
#include "bluetooth/bt_uuid.h"
#include "bluetooth/bt_app.h"
#include "bluetooth/bt_appearance.h"
#include "bluetooth/bt_gatt.h"
#include "bluetooth/bt_gap.h"
#include "bluetooth/bt_dev.h"
#include "app_evt_handler.h"

/******** For DEBUG ************/
//#define UART_DEBUG_ENABLE

#ifdef UART_DEBUG_ENABLE
#include "coredev/uart.h"
extern UART g_Uart;
#define DEBUG_PRINTF(...)		g_Uart.printf(__VA_ARGS__)
#else
#define DEBUG_PRINTF(...)
#endif
/*******************************/

/// Unit conversion macros (same as old nRF5_SDK definitions)
#define UNIT_0_625_MS					625			/**< Number of microseconds in 0.625 milliseconds. */
#define UNIT_10_MS						10000		/**< Number of microseconds in 10 milliseconds. */
#define MSEC_TO_UNITS(MS, UNIT)			(((MS) * 1000) / (UNIT))

#define BTAPP_CONN_CFG_TAG				CONFIG_NRF_SDH_BLE_CONN_TAG

#define BTAPP_OBSERVER_PRIO				USER		/**< Application's BLE observer priority. */

#ifndef GATT_MTU_SIZE_DEFAULT
#if defined(BLE_GATT_ATT_MTU_DEFAULT)
#define GATT_MTU_SIZE_DEFAULT			BLE_GATT_ATT_MTU_DEFAULT
#elif defined(BLE_GATT_MTU_SIZE_DEFAULT)
#define GATT_MTU_SIZE_DEFAULT			BLE_GATT_MTU_SIZE_DEFAULT
#else
#define GATT_MTU_SIZE_DEFAULT			23
#endif
#endif

#define SEC_PARAM_MIN_KEY_SIZE			7			/**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE			16			/**< Maximum encryption key size. */

// S145 tx_power values (nRF54L15)
static const int8_t s_TxPowerdBm[] = {
	-40, -20, -16, -12, -8, -4, 0, 2, 3, 4, 5, 6, 7, 8
};
static const int s_NbTxPowerdBm = sizeof(s_TxPowerdBm) / sizeof(int8_t);

#pragma pack(push, 4)

typedef struct __Bt_App_Data {
	BTAPP_STATE State;
	BTAPP_ROLE Role;
	uint8_t AdvHdl;		///< Advertisement handle
	uint16_t ConnHdl;	///< BLE connection handle
	int ConnLedPort;
	int ConnLedPin;
	uint8_t ConnLedActLevel;
	uint16_t VendorId;
	uint16_t ProductId;
	uint16_t ProductVer;
	uint16_t Appearance;
	ble_gap_adv_params_t AdvParam;
	void (*SDEvtHandler)(void) ;
	int MaxMtu;
	bool bSecure;
	bool bExtAdv;
	bool bScan;
} BtAppData_t;

#pragma pack(pop)

static BtAppData_t s_BtAppData = {
	BTAPP_STATE_UNKNOWN, BTAPP_ROLE_PERIPHERAL,
	BLE_GAP_ADV_SET_HANDLE_NOT_SET, BLE_CONN_HANDLE_INVALID,
};

// --- Advertisement packet buffers ---

alignas(4) static uint8_t s_BtAppAdvBuff[256];
alignas(4) static BtAdvPacket_t s_BtAppAdvPkt = { 31, 0, s_BtAppAdvBuff };
alignas(4) static BtAdvPacket_t s_BtAppExtAdvPkt = { 255, 0, s_BtAppAdvBuff };

alignas(4) static uint8_t s_BtAppSrBuff[256];
alignas(4) static BtAdvPacket_t s_BtAppSrPkt = { 31, 0, s_BtAppSrBuff };
alignas(4) static BtAdvPacket_t s_BtAppExtSrPkt = { 255, 0, s_BtAppSrBuff };

static ble_gap_adv_data_t s_BtAppAdvData = {
	.adv_data = { s_BtAppAdvBuff, 0 },
	.scan_rsp_data = { s_BtAppSrBuff, 0 }
};


const static TimerCfg_t s_BtAppSdTimerCfg = {
    .DevNo = 3,	// GRTC3 needed for Softdevice
	.ClkSrc = TIMER_CLKSRC_DEFAULT,
	.Freq = 0,			// 0 => Default frequency
	.IntPrio = 0,
	.EvtHandler = nullptr,
	.bTickInt = false,
};

static Timer s_BtAppSdGrtc3;

// --- Helper functions ---

bool BtInitialized()
{
	return s_BtAppData.State != BTAPP_STATE_UNKNOWN;
}

bool BtConnected()
{
	return s_BtAppData.ConnHdl != BLE_CONN_HANDLE_INVALID;
}

bool isConnected()
{
	return s_BtAppData.ConnHdl != BLE_CONN_HANDLE_INVALID;
}

uint16_t BtAppGetConnHandle()
{
	return s_BtAppData.ConnHdl;
}

int8_t GetValidTxPower(int TxPwr)
{
	int8_t retval = s_TxPowerdBm[0];

	for (int i = 1; i < s_NbTxPowerdBm; i++)
	{
		if (s_TxPowerdBm[i] > TxPwr)
			break;
		retval = s_TxPowerdBm[i];
	}

	return retval;
}

// --- Connection LED helpers ---

static void BtAppConnLedOff()
{
	if (s_BtAppData.ConnLedPort < 0 || s_BtAppData.ConnLedPin < 0)
		return;

	if (s_BtAppData.ConnLedActLevel)
		IOPinClear(s_BtAppData.ConnLedPort, s_BtAppData.ConnLedPin);
	else
		IOPinSet(s_BtAppData.ConnLedPort, s_BtAppData.ConnLedPin);
}

static void BtAppConnLedOn()
{
	if (s_BtAppData.ConnLedPort < 0 || s_BtAppData.ConnLedPin < 0)
		return;

	if (s_BtAppData.ConnLedActLevel)
		IOPinSet(s_BtAppData.ConnLedPort, s_BtAppData.ConnLedPin);
	else
		IOPinClear(s_BtAppData.ConnLedPort, s_BtAppData.ConnLedPin);
}

// --- Conn params event handler ---

static void on_conn_params_evt(const struct ble_conn_params_evt *p_evt)
{
	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_ERROR)
	{
		sd_ble_gap_disconnect(s_BtAppData.ConnHdl,
							  BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
	}
}

// --- BLE event dispatch (registered as observer) ---

static void ble_evt_dispatch(const ble_evt_t *p_ble_evt, void *p_context)
{
	uint32_t err_code;
	const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;
	uint8_t role = ble_conn_state_role(p_ble_evt->evt.gap_evt.conn_handle);

	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
			BtAppConnLedOn();
			BtGapAddConnection(p_gap_evt->conn_handle, role,
							   p_gap_evt->params.connected.peer_addr.addr_type,
							   (uint8_t *)p_gap_evt->params.connected.peer_addr.addr);
			s_BtAppData.ConnHdl = p_ble_evt->evt.gap_evt.conn_handle;
			s_BtAppData.State = BTAPP_STATE_CONNECTED;
			BtAppEvtConnected(p_ble_evt->evt.gap_evt.conn_handle);
			break;

		case BLE_GAP_EVT_DISCONNECTED:
			BtAppConnLedOff();
			s_BtAppData.ConnHdl = BLE_CONN_HANDLE_INVALID;
			s_BtAppData.State = BTAPP_STATE_IDLE;
			BtAppEvtDisconnected(p_ble_evt->evt.gap_evt.conn_handle);
			if (s_BtAppData.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
			break;

		case BLE_GAP_EVT_ADV_SET_TERMINATED:
			BtAppAdvTimeoutHandler();
			break;

