IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			const ble_gap_phys_t phys = {
				BLE_GAP_PHY_AUTO,
				BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			(void)err_code;
		}
		break;

		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
		{
			ble_gap_data_length_params_t dl_params;
			memset(&dl_params, 0, sizeof(dl_params));
			err_code = sd_ble_gap_data_length_update(
				p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
			(void)err_code;
		}
		break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			err_code = sd_ble_gatts_sys_attr_set(
				s_BtAppData.ConnHdl, NULL, 0, 0);
			(void)err_code;
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
		{
			uint16_t mtu = s_BtAppData.MaxMtu;
			err_code = sd_ble_gatts_exchange_mtu_reply(
				p_ble_evt->evt.gatts_evt.conn_handle, mtu);
			(void)err_code;
		}
		break;

		default:
			break;
	}

	// Forward to central/observer handlers
	if ((role == BLE_GAP_ROLE_CENTRAL) ||
		(s_BtAppData.Role & (BTAPP_ROLE_CENTRAL | BTAPP_ROLE_OBSERVER)))
	{
		switch (p_ble_evt->header.evt_id)
		{
			case BLE_GAP_EVT_ADV_REPORT:
			{
				const ble_gap_evt_adv_report_t *p_adv_report =
					&p_gap_evt->params.adv_report;
				BtAppScanReport(p_adv_report->rssi,
								p_adv_report->peer_addr.addr_type,
								(uint8_t *)p_adv_report->peer_addr.addr,
								p_adv_report->data.len,
								p_adv_report->data.p_data);
			}
			break;

			case BLE_GAP_EVT_TIMEOUT:
			{
				const ble_gap_evt_timeout_t *p_timeout =
					&p_gap_evt->params.timeout;
				if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
				{
					s_BtAppData.bScan = false;
				}
			}
			break;

			default:
				break;
		}
		BtAppCentralEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}

	// Forward to peripheral handlers
	if (s_BtAppData.Role & BTAPP_ROLE_PERIPHERAL)
	{
		BtGattEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
		BtAppPeriphEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}
}

// Register as BLE event observer
NRF_SDH_BLE_OBSERVER(s_BtAppBleObserver, ble_evt_dispatch, NULL, USER);

// Note: SoC event polling is handled internally by nrf_sdh_soc.c
// which registers its own NRF_SDH_STACK_EVT_OBSERVER.

// --- Advertising ---

void BtAdvStart()
{
	if (s_BtAppData.State == BTAPP_STATE_ADVERTISING ||
		s_BtAppData.ConnHdl != BLE_CONN_HANDLE_INVALID)
	{
		return;
	}

	uint32_t err_code = sd_ble_gap_adv_start(s_BtAppData.AdvHdl, BTAPP_CONN_CFG_TAG);
	if (err_code == NRF_SUCCESS)
	{
		s_BtAppData.State = BTAPP_STATE_ADVERTISING;
	}
	else
	{
		DEBUG_PRINTF("BtAdvStart failed: 0x%x\r\n", err_code);
	}
}

void BtAdvStop()
{
	sd_ble_gap_adv_stop(s_BtAppData.AdvHdl);
	s_BtAppData.State = BTAPP_STATE_IDLE;
}

/**
 * @brief Overloadable advertising initialization
 */
__attribute__((weak)) bool BtAppAdvInit(const BtAppCfg_t *pCfg)
{
	uint8_t flags = BT_GAP_DATA_TYPE_FLAGS_NO_BREDR;
	BtAdvPacket_t *advpkt;
	BtAdvPacket_t *srpkt;

	memset(&s_BtAppData.AdvParam, 0, sizeof(ble_gap_adv_params_t));

	if (s_BtAppData.bExtAdv)
	{
		advpkt = &s_BtAppExtAdvPkt;
		srpkt = &s_BtAppExtSrPkt;
	}
	else
	{
		advpkt = &s_BtAppAdvPkt;
		srpkt = &s_BtAppSrPkt;
	}

	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		if (pCfg->AdvTimeout != 0)
			flags |= BT_GAP_DATA_TYPE_FLAGS_LIMITED_DISCOVERABLE;
		else
			flags |= BT_GAP_DATA_TYPE_FLAGS_GENERAL_DISCOVERABLE;

		s_BtAppData.AdvParam.properties.type = pCfg->bExtAdv ?
			BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED :
			BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
	}
	else if (pCfg->Role & BTAPP_ROLE_BROADCASTER)
	{
		s_BtAppData.AdvParam.properties.type = pCfg->bExtAdv ?
			BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED :
			BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
	}

	if (BtAdvDataAdd(advpkt, BT_GAP_DATA_TYPE_FLAGS, &flags, 1) == false)
	{
		return false;
	}

	if (pCfg->Appearance != BT_APPEAR_UNKNOWN_GENERIC)
	{
		// Appearance is optional - don't fail if it doesn't fit
		BtAdvDataAdd(advpkt, BT_GAP_DATA_TYPE_APPEARANCE,
					 (uint8_t *)&pCfg->Appearance, 2);
	}

	// Manufacturer specific data in adv packet
	if (pCfg->bExtAdv == false)
	{
		if (pCfg->pAdvManData != NULL)
		{
			int l = pCfg->AdvManDataLen + 2;
			BtAdvData_t *p = BtAdvDataAllocate(advpkt,
				BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);
			if (p)
			{
				*(uint16_t *)p->Data = pCfg->VendorId;
				memcpy(&p->Data[2], pCfg->pAdvManData, pCfg->AdvManDataLen);
			}
		}

		if (pCfg->pSrManData != NULL)
		{
			int l = pCfg->SrManDataLen + 2;
			BtAdvData_t *p = BtAdvDataAllocate(srpkt,
				BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);
			if (p)
			{
				*(uint16_t *)p->Data = pCfg->VendorId;
				memcpy(&p->Data[2], pCfg->pSrManData, pCfg->SrManDataLen);
			}
		}
	}
	else
	{
		// Extended advertising: combine manuf data into single adv packet
		int l = 2;
		if (pCfg->pAdvManData)
			l += pCfg->AdvManDataLen;
		if (pCfg->pSrManData)
			l += pCfg->SrManDataLen;

		if (l > 2)
		{
			BtAdvData_t *p = BtAdvDataAllocate(advpkt,
				BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);
			if (p)
			{
				*(uint16_t *)p->Data = pCfg->VendorId;
				int off = 2;
				if (pCfg->pAdvManData)
				{
					memcpy(&p->Data[off], pCfg->pAdvManData, pCfg->AdvManDataLen);
					off += pCfg->AdvManDataLen;
				}
				if (pCfg->pSrManData)
				{
					memcpy(&p->Data[off], pCfg->pSrManData, pCfg->SrManDataLen);
				}
			}
		}
	}

	BtAdvPacket_t *uidadvpkt;

	// Device name
	if (pCfg->pDevName != NULL)
	{
		if (BtAdvDataSetDevName(advpkt, pCfg->pDevName) == false)
		{
			return false;
		}
		uidadvpkt = pCfg->bExtAdv ? advpkt : srpkt;
	}
	else
	{
		uidadvpkt = advpkt;
	}

	// Service UUIDs
	if (pCfg->pAdvUuid != NULL && (pCfg->Role & BTAPP_ROLE_PERIPHERAL))
	{
		BtAdvDataAddUuid(uidadvpkt, pCfg->pAdvUuid, pCfg->bCompleteUuidList);
	}

	// Configure adv params
	s_BtAppData.AdvParam.p_peer_addr	= NULL;
	s_BtAppData.AdvParam.interval		= MSEC_TO_UNITS(pCfg->AdvInterval, UNIT_0_625_MS);
	s_BtAppData.AdvParam.duration		= MSEC_TO_UNITS(pCfg->AdvTimeout, UNIT_10_MS);
	s_BtAppData.AdvParam.filter_policy	= BLE_GAP_ADV_FP_ANY;
	s_BtAppData.AdvParam.primary_phy	= BLE_GAP_PHY_1MBPS;
	s_BtAppData.AdvParam.secondary_phy	= BLE_GAP_PHY_2MBPS;

