IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	s_BtAppAdvData.adv_data.len = advpkt->Len;
	s_BtAppAdvData.scan_rsp_data.len = srpkt->Len;

	uint32_t err_code = sd_ble_gap_adv_set_configure(
		&s_BtAppData.AdvHdl, &s_BtAppAdvData, &s_BtAppData.AdvParam);

	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("sd_ble_gap_adv_set_configure failed: 0x%x\r\n", err_code);
		return false;
	}

	return true;
}

bool BtAppAdvManDataSet(uint8_t *pAdvData, int AdvLen, uint8_t *pSrData, int SrLen)
{
	if (s_BtAppData.State != BTAPP_STATE_ADVERTISING &&
		s_BtAppData.State != BTAPP_STATE_IDLE)
	{
		return false;
	}

	BtAdvPacket_t *advpkt;
	BtAdvPacket_t *srpkt;

	if (s_BtAppData.bExtAdv)
	{
		advpkt = &s_BtAppExtAdvPkt;
		srpkt = &s_BtAppExtSrPkt;
	}
	else
	{
		advpkt = &s_BtAppAdvPkt;
		srpkt = &s_BtAppSrPkt;
	}

	if (pAdvData)
	{
		int l = AdvLen + 2;
		BtAdvData_t *p = BtAdvDataAllocate(advpkt,
			BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);
		if (p == NULL)
			return false;
		*(uint16_t *)p->Data = s_BtAppData.VendorId;
		memcpy(&p->Data[2], pAdvData, AdvLen);
		s_BtAppAdvData.adv_data.len = advpkt->Len;
	}

	if (pSrData)
	{
		int l = SrLen + 2;
		BtAdvData_t *p = BtAdvDataAllocate(srpkt,
			BT_GAP_DATA_TYPE_MANUF_SPECIFIC_DATA, l);
		if (p == NULL)
			return false;
		*(uint16_t *)p->Data = s_BtAppData.VendorId;
		memcpy(&p->Data[2], pSrData, SrLen);
		s_BtAppAdvData.scan_rsp_data.len = srpkt->Len;
	}

	// SDK15+ doesn't allow dynamic adv data update: stop and reconfigure
	if (s_BtAppData.State == BTAPP_STATE_ADVERTISING)
	{
		sd_ble_gap_adv_stop(s_BtAppData.AdvHdl);
	}

	sd_ble_gap_adv_set_configure(&s_BtAppData.AdvHdl, &s_BtAppAdvData, NULL);

	if (s_BtAppData.State == BTAPP_STATE_ADVERTISING)
	{
		s_BtAppData.State = BTAPP_STATE_IDLE;
		BtAdvStart();
	}

	return s_BtAppData.State == BTAPP_STATE_ADVERTISING;
}

// --- Notify ---

bool BtAppNotify(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (s_BtAppData.ConnHdl == BLE_CONN_HANDLE_INVALID)
		return false;

	BtGattCharSetValue(pChar, pData, DataLen);

	if (pChar->bNotify == false)
		return false;

	ble_gatts_hvx_params_t params;
	memset(&params, 0, sizeof(params));
	params.type = BLE_GATT_HVX_NOTIFICATION;
	params.handle = pChar->ValHdl;
	params.p_data = pData;
	params.p_len = &DataLen;

	sd_ble_gatts_hvx(s_BtAppData.ConnHdl, &params);

	return true;
}

// --- Disconnect ---

void BtAppDisconnect()
{
	if (s_BtAppData.ConnHdl != BLE_CONN_HANDLE_INVALID)
	{
		uint32_t err_code = sd_ble_gap_disconnect(
			s_BtAppData.ConnHdl,
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		if (err_code == NRF_ERROR_INVALID_STATE)
		{
			s_BtAppData.ConnHdl = BLE_CONN_HANDLE_INVALID;
		}
	}
}

void BtAppGapDeviceNameSet(const char *pDeviceName)
{
	BtGapSetDevName(pDeviceName);
}

void BtAppEnterDfu()
{
	// Not supported on nRF54L15 S145 yet
	NVIC_SystemReset();
}

// --- DIS initialization ---

static void BtDisInit(const BtAppCfg_t *pCfg)
{
	// sdk-nrf-bm DIS uses Kconfig values for device info strings.
	// Call ble_dis_init() with security settings based on SecType.
	// Note: BLE_DIS_CONFIG_SEC_MODE_DEFAULT uses C nested designated
	// initializers (.device_info_char.read = ...) which are not valid
	// in C++. Initialize manually.
	struct ble_dis_config dis_cfg = {};
	dis_cfg.sec_mode.device_info_char.read.sm = 1;
	dis_cfg.sec_mode.device_info_char.read.lv = 1;

	switch (pCfg->SecType)
	{
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
		case BTGAP_SECTYPE_LESC_MITM:
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			// Just works / signed
			break;
		case BTGAP_SECTYPE_NONE:
		default:
			// Open access
			break;
	}

	ble_dis_init(&dis_cfg);
}

// --- Stack Init ---


__attribute__((weak)) void SoftdeviceFaultHandler(uint32_t id, uint32_t pc, uint32_t info)
{
	DEBUG_PRINTF("SoftDevice fault! ID %#x, PC %#x, Info %#x", id, pc, info);

	switch (id) {
	case NRF_FAULT_ID_SD_ASSERT:
		DEBUG_PRINTF("NRF_FAULT_ID_SD_ASSERT: SoftDevice assert");
		break;
	case NRF_FAULT_ID_APP_MEMACC:
		DEBUG_PRINTF("NRF_FAULT_ID_APP_MEMACC: Application bad memory access");
		if (info == 0x00) {
			DEBUG_PRINTF("Application tried to access SoftDevice RAM");
		} else {
			DEBUG_PRINTF("Application tried to access SoftDevice peripheral at %#x", info);
		}
		break;
	}

	for (;;) {
		/* loop */
	}
}

/* Extern in nrf_sdh.c (called directly at enable time for scheduler model) */
void BtAppSDRandSeed(uint32_t evt, void *ctx)
{
	uint32_t nrf_err;
	uint8_t seed[SD_RAND_SEED_SIZE];

	(void)ctx;

	if (evt == NRF_EVT_RAND_SEED_REQUEST)
	{
		if (nrfx_cracen_entropy_get(seed, sizeof(seed)) != 0)
		{
			return;
		}

		nrf_err = sd_rand_seed_set(seed);
		(void)nrf_err;
	}
}

/**
 * @brief Initialize the SoftDevice BLE stack.
 *
 * In the bm framework, nrf_sdh.c handles the clock configuration
 * automatically from g_McuOsc, and nrf_sdh_ble.c handles the BLE
 * configuration from CONFIG_ defaults.  This function just
 * requests SD enable and then enables the BLE stack.
 */
bool BtAppStackInit(const BtAppCfg_t *pCfg)
{
	int err;
	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_enable_request\r\n");

	s_BtAppSdGrtc3.Init(s_BtAppSdTimerCfg);

	// Enable SoftDevice
	err = nrf_sdh_enable_request();
	if (err && err != -EALREADY)
	{
		DEBUG_PRINTF("nrf_sdh_enable_request failed: %d\r\n", err);
		return false;
	}


	// Require before call to nrf_sdh_ble_enable
	BtAppSDRandSeed(NRF_EVT_RAND_SEED_REQUEST, NULL);

	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_ble_enable\r\n");

	// Enable BLE stack (cfg_set from CONFIG_ defaults, handled in nrf_sdh_ble.c)
	err = nrf_sdh_ble_enable(BTAPP_CONN_CFG_TAG);
	if (err)
	{
		DEBUG_PRINTF("nrf_sdh_ble_enable failed: %d\r\n", err);
		return false;
	}

	// Initialize connection state tracking
	ble_conn_state_init();

	return true;
}

/**
 * @brief Initialize the Bluetooth application.
 *
 * This function initializes the SoftDevice, BLE stack, GAP parameters,
 * GATT services, advertising, and security.
 */
bool BtAppInit(const BtAppCfg_t *pCfg)
{
	uint32_t err_code;

	// Initialize application event handler
	if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
	{
		return false;
	}

	// Populate internal app data from config
	s_BtAppData.Role = pCfg->Role;
	s_BtAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	s_BtAppData.ConnHdl = BLE_CONN_HANDLE_INVALID;
	s_BtAppData.bExtAdv = pCfg->bExtAdv;
	s_BtAppData.ConnLedPort = pCfg->ConnLedPort;
	s_BtAppData.ConnLedPin = pCfg->ConnLedPin;
	s_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	s_BtAppData.bScan = false;
	s_BtAppData.VendorId = pCfg->VendorId;
	s_BtAppData.ProductId = pCfg->ProductId;
	s_BtAppData.ProductVer = pCfg->ProductVer;
	s_BtAppData.Appearance = pCfg->Appearance;

	s_BtAppData.MaxMtu = GATT_MTU_SIZE_DEFAULT;
	if (pCfg->MaxMtu > GATT_MTU_SIZE_DEFAULT)
		s_BtAppData.MaxMtu = pCfg->MaxMtu;

	// Setup connection LED
	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
	{
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
		BtAppConnLedOff();
	}

	// Initialize SoftDevice + BLE stack
	if (BtAppStackInit(pCfg) == false)
	{
		DEBUG_PRINTF("BtAppStackInit failed\r\n");
		return false;
	}


	// Set GAP appearance
	err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
	(void)err_code;

	// Initialize GAP parameters
	BtGapCfg_t gapcfg = {
		.Role = pCfg->Role,
		.SecType = pCfg->SecType,
		.AdvInterval = pCfg->AdvInterval,
		.AdvTimeout = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout = BT_GAP_CONN_SUP_TIMEOUT
	};

	BtGapInit(&gapcfg);

