IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		BtAppInitUserServices();
	}

	// Initialize Device Information Service
	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

	// Initialize user data
	BtAppInitUserData();

	s_BtAppData.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

	// Initialize advertising
	if (s_BtAppData.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}

		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_ADV,
			s_BtAppData.AdvHdl,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}
	else
	{
		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_SCAN_INIT,
			0,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}

	s_BtAppData.State = BTAPP_STATE_INITIALIZED;

	DEBUG_PRINTF("BtAppInit: success\r\n");

	return true;
}

/**
 * @brief Main BLE application run loop.
 *
 * Starts advertising (if peripheral/broadcaster) then enters the
 * main event loop.  SoftDevice events are dispatched through the
 * observer infrastructure triggered by the SD_EVT interrupt.
 */
void BtAppRun()
{
	if (s_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (s_BtAppData.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
    	if (s_BtAppData.SDEvtHandler != NULL)
		{
    		// TODO
			//BtAppRtosWaitEvt();
		}
		else
		{
			AppEvtHandlerExec();

			// Wait for event (low power sleep)
			// bm framework uses __WFE() directly, not sd_app_evt_wait()
			__WFE();
			__SEV();
			__WFE();
		}
	}
}

static void soc_evt_poll(void *context)
{
	uint32_t nrf_err;
	uint32_t evt_id;

	while (true) {
		nrf_err = sd_evt_get(&evt_id);
		if (nrf_err) {
			break;
		}

		/* Forward the event to SoC observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_soc_evt_observer, nrf_sdh_soc_evt_observers, obs) {
			obs->handler(evt_id, obs->context);
		}
	}

	__ASSERT(nrf_err == NRF_ERROR_NOT_FOUND,
		 "Failed to receive SoftDevice SoC event, nrf_error %#x", nrf_err);
}

/* Auto-handle seed requests as a SoC event observer */
NRF_SDH_SOC_OBSERVER(rand_seed, BtAppSDRandSeed, NULL, HIGH);
/* Listen to SoftDevice events */
NRF_SDH_STACK_EVT_OBSERVER(soc_evt_obs, soc_evt_poll, NULL, HIGHEST);

